{
  "transform_params" : {
    "input1" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_1_output",
      "pad_pad_mode" : 0,
      "pad_t" : 4,
      "pad_r" : 4,
      "pad_b" : 4,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "input1",
      "pad_l" : 4,
      "name" : "zero_padding2d_1",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_1_output",
      "K" : 3,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "zero_padding2d_1_output",
      "weights" : {
        "W_U8" : 1,
        "per_ch_qscale" : 5,
        "per_ch_qbias" : 3
      },
      "pad_mode" : 0,
      "Nx" : 9,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_1_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 7,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_1_output",
      "C" : 32,
      "type" : "batchnorm",
      "name" : "batch_normalization_1"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_1_output",
      "type" : "activation",
      "name" : "activation_1",
      "bottom" : "batch_normalization_1_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_2_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_1_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_2",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_2_output",
      "K" : 32,
      "stride_x" : 2,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "zero_padding2d_2_output",
      "weights" : {
        "W_U8" : 9,
        "per_ch_qscale" : 13,
        "per_ch_qbias" : 11
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_2_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 15,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_2_output",
      "C" : 64,
      "type" : "batchnorm",
      "name" : "batch_normalization_2"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_2_output",
      "type" : "activation",
      "name" : "activation_2",
      "bottom" : "batch_normalization_2_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_3_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_2_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_3",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3_output",
      "K" : 64,
      "stride_x" : 2,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_3_output",
      "weights" : {
        "W_U8" : 17,
        "per_ch_qscale" : 21,
        "per_ch_qbias" : 19
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_3_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 23,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_3_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_3"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_3_output",
      "type" : "activation",
      "name" : "activation_3",
      "bottom" : "batch_normalization_3_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_4_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_3_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_4",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_4_output",
      "K" : 128,
      "name" : "conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_4_output",
      "weights" : {
        "W_U8" : 25,
        "per_ch_qscale" : 29,
        "per_ch_qbias" : 27
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_4_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 31,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_4_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_4"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_4_output",
      "type" : "activation",
      "name" : "activation_4",
      "bottom" : "batch_normalization_4_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_5_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_4_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_5",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_5_output",
      "K" : 128,
      "name" : "conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_5_output",
      "weights" : {
        "W_U8" : 33,
        "per_ch_qscale" : 37,
        "per_ch_qbias" : 35
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_5_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 39,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_5_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_5"
    },
    {
      "alpha" : 1,
      "bottom" : "activation_3_output,batch_normalization_5_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_6_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "add_1_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_6",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_6_output",
      "K" : 128,
      "name" : "conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_6_output",
      "weights" : {
        "W_U8" : 41,
        "per_ch_qscale" : 45,
        "per_ch_qbias" : 43
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_6_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 47,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_6_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_6"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_5_output",
      "type" : "activation",
      "name" : "activation_5",
      "bottom" : "batch_normalization_6_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_7_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_5_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_7",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_7_output",
      "K" : 128,
      "name" : "conv2d_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_7_output",
      "weights" : {
        "W_U8" : 49,
        "per_ch_qscale" : 53,
        "per_ch_qbias" : 51
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_7_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 55,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_7_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_7"
    },
    {
      "alpha" : 1,
      "bottom" : "add_1_output,batch_normalization_7_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_8_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "add_2_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_8",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_8_output",
      "K" : 128,
      "name" : "conv2d_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_8_output",
      "weights" : {
        "W_U8" : 57,
        "per_ch_qscale" : 61,
        "per_ch_qbias" : 59
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_8_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 63,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_8_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_8"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_6_output",
      "type" : "activation",
      "name" : "activation_6",
      "bottom" : "batch_normalization_8_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_9_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_6_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_9",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_9_output",
      "K" : 128,
      "name" : "conv2d_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_9_output",
      "weights" : {
        "W_U8" : 65,
        "per_ch_qscale" : 69,
        "per_ch_qbias" : 67
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_9_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 71,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_9_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_9"
    },
    {
      "alpha" : 1,
      "bottom" : "add_2_output,batch_normalization_9_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_3_output",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_10_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "add_3_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_10",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_10_output",
      "K" : 128,
      "name" : "conv2d_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_10_output",
      "weights" : {
        "W_U8" : 73,
        "per_ch_qscale" : 77,
        "per_ch_qbias" : 75
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_10_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 79,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_10_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_10"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_7_output",
      "type" : "activation",
      "name" : "activation_7",
      "bottom" : "batch_normalization_10_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_11_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_7_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_11",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_11_output",
      "K" : 128,
      "name" : "conv2d_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_11_output",
      "weights" : {
        "W_U8" : 81,
        "per_ch_qscale" : 85,
        "per_ch_qbias" : 83
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_11_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 87,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_11_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_11"
    },
    {
      "alpha" : 1,
      "bottom" : "add_3_output,batch_normalization_11_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_4_output",
      "type" : "elementwise",
      "name" : "add_4",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_12_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "add_4_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_12",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_12_output",
      "K" : 128,
      "name" : "conv2d_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_12_output",
      "weights" : {
        "W_U8" : 89,
        "per_ch_qscale" : 93,
        "per_ch_qbias" : 91
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_12_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 95,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_12_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_12"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_8_output",
      "type" : "activation",
      "name" : "activation_8",
      "bottom" : "batch_normalization_12_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_13_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_8_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_13",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_13_output",
      "K" : 128,
      "name" : "conv2d_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "zero_padding2d_13_output",
      "weights" : {
        "W_U8" : 97,
        "per_ch_qscale" : 101,
        "per_ch_qbias" : 99
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_13_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 103,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_13_output",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "batch_normalization_13"
    },
    {
      "alpha" : 1,
      "bottom" : "add_4_output,batch_normalization_13_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_5_output",
      "type" : "elementwise",
      "name" : "add_5",
      "beta" : 0
    },
    {
      "bottom" : "add_5_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "up_sampling2d_1_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "up_sampling2d_1"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_14_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "up_sampling2d_1_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_14",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_14_output",
      "K" : 128,
      "name" : "conv2d_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "zero_padding2d_14_output",
      "weights" : {
        "W_U8" : 105,
        "per_ch_qscale" : 109,
        "per_ch_qbias" : 107
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_14_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 111,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_14_output",
      "C" : 64,
      "type" : "batchnorm",
      "name" : "batch_normalization_14"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_9_output",
      "type" : "activation",
      "name" : "activation_9",
      "bottom" : "batch_normalization_14_output"
    },
    {
      "bottom" : "activation_9_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "up_sampling2d_2_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "up_sampling2d_2"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_15_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "up_sampling2d_2_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_15",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_15_output",
      "K" : 64,
      "name" : "conv2d_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "zero_padding2d_15_output",
      "weights" : {
        "W_U8" : 113,
        "per_ch_qscale" : 117,
        "per_ch_qbias" : 115
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_15_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 119,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_15_output",
      "C" : 32,
      "type" : "batchnorm",
      "name" : "batch_normalization_15"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_10_output",
      "type" : "activation",
      "name" : "activation_10",
      "bottom" : "batch_normalization_15_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_16_output",
      "pad_pad_mode" : 0,
      "pad_t" : 4,
      "pad_r" : 4,
      "pad_b" : 4,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "activation_10_output",
      "pad_l" : 4,
      "name" : "zero_padding2d_16",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_16_output",
      "K" : 32,
      "name" : "conv2d_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 3,
      "bottom" : "zero_padding2d_16_output",
      "weights" : {
        "W_U8" : 121,
        "per_ch_qscale" : 125,
        "per_ch_qbias" : 123
      },
      "pad_mode" : 0,
      "Nx" : 9,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv2d_16_output",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 127,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "batch_normalization_16_output",
      "C" : 3,
      "type" : "batchnorm",
      "name" : "batch_normalization_16"
    },
    {
      "mode" : 1,
      "weights" : {

      },
      "top" : "unscaled_output1",
      "type" : "activation",
      "name" : "activation_11",
      "bottom" : "batch_normalization_16_output"
    },
    {
      "k" : 1,
      "bottom" : "",
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "constant_blob" : 129,
      "top" : "scaled_output1_constant_in_scale",
      "w" : 1,
      "type" : "load_constant",
      "name" : "scaled_output1"
    },
    {
      "k" : 1,
      "bottom" : "",
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "constant_blob" : 131,
      "top" : "scaled_output1_constant_in_bias",
      "w" : 1,
      "type" : "load_constant",
      "name" : "scaled_output1"
    },
    {
      "alpha" : 1,
      "bottom" : "unscaled_output1,scaled_output1_constant_in_scale",
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "scaled_output1_mul_out",
      "type" : "elementwise",
      "name" : "scaled_output1",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "scaled_output1_mul_out,scaled_output1_constant_in_bias",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "output1",
      "type" : "elementwise",
      "name" : "scaled_output1",
      "beta" : 0
    }
  ]
}