{
  "transform_params" : {
    "inputImage" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_value" : 0,
      "top" : "63",
      "pad_pad_mode" : 0,
      "pad_t" : 4,
      "pad_r" : 4,
      "pad_b" : 4,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "inputImage",
      "pad_l" : 4,
      "name" : "63",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "64",
      "K" : 3,
      "blob_biases" : 1,
      "name" : "64",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "63",
      "weights" : {
        "W_U8" : 3,
        "per_ch_qscale" : 7,
        "per_ch_qbias" : 5
      },
      "pad_mode" : 0,
      "Nx" : 9,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "64",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 9,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "67",
      "C" : 32,
      "type" : "batchnorm",
      "name" : "67"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "68",
      "type" : "activation",
      "name" : "68",
      "bottom" : "67"
    },
    {
      "pad_value" : 0,
      "top" : "69",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "68",
      "pad_l" : 1,
      "name" : "69",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "70",
      "K" : 32,
      "blob_biases" : 11,
      "stride_x" : 2,
      "name" : "70",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "69",
      "weights" : {
        "W_U8" : 13,
        "per_ch_qscale" : 17,
        "per_ch_qbias" : 15
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "70",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 19,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "73",
      "C" : 64,
      "type" : "batchnorm",
      "name" : "73"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "74",
      "type" : "activation",
      "name" : "74",
      "bottom" : "73"
    },
    {
      "pad_value" : 0,
      "top" : "75",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "74",
      "pad_l" : 1,
      "name" : "75",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "76",
      "K" : 64,
      "blob_biases" : 21,
      "stride_x" : 2,
      "name" : "76",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "75",
      "weights" : {
        "W_U8" : 23,
        "per_ch_qscale" : 27,
        "per_ch_qbias" : 25
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "76",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 29,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "79",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "79"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "80",
      "type" : "activation",
      "name" : "80",
      "bottom" : "79"
    },
    {
      "pad_value" : 0,
      "top" : "81",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "80",
      "pad_l" : 1,
      "name" : "81",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "82",
      "K" : 128,
      "blob_biases" : 31,
      "name" : "82",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "81",
      "weights" : {
        "W_U8" : 33,
        "per_ch_qscale" : 37,
        "per_ch_qbias" : 35
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "82",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 39,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "85",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "85"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "86",
      "type" : "activation",
      "name" : "86",
      "bottom" : "85"
    },
    {
      "pad_value" : 0,
      "top" : "87",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "86",
      "pad_l" : 1,
      "name" : "87",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "88",
      "K" : 128,
      "blob_biases" : 41,
      "name" : "88",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "87",
      "weights" : {
        "W_U8" : 43,
        "per_ch_qscale" : 47,
        "per_ch_qbias" : 45
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "88",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 49,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "91",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "91"
    },
    {
      "alpha" : 1,
      "bottom" : "91,80",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "92",
      "type" : "elementwise",
      "name" : "92",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "93",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "92",
      "pad_l" : 1,
      "name" : "93",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "94",
      "K" : 128,
      "blob_biases" : 51,
      "name" : "94",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "93",
      "weights" : {
        "W_U8" : 53,
        "per_ch_qscale" : 57,
        "per_ch_qbias" : 55
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "94",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 59,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "97",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "97"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "98",
      "type" : "activation",
      "name" : "98",
      "bottom" : "97"
    },
    {
      "pad_value" : 0,
      "top" : "99",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "98",
      "pad_l" : 1,
      "name" : "99",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "100",
      "K" : 128,
      "blob_biases" : 61,
      "name" : "100",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "99",
      "weights" : {
        "W_U8" : 63,
        "per_ch_qscale" : 67,
        "per_ch_qbias" : 65
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "100",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 69,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "103",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "103"
    },
    {
      "alpha" : 1,
      "bottom" : "103,92",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "104",
      "type" : "elementwise",
      "name" : "104",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "105",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "104",
      "pad_l" : 1,
      "name" : "105",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "106",
      "K" : 128,
      "blob_biases" : 71,
      "name" : "106",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "105",
      "weights" : {
        "W_U8" : 73,
        "per_ch_qscale" : 77,
        "per_ch_qbias" : 75
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "106",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 79,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "109",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "109"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "110",
      "type" : "activation",
      "name" : "110",
      "bottom" : "109"
    },
    {
      "pad_value" : 0,
      "top" : "111",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "110",
      "pad_l" : 1,
      "name" : "111",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "112",
      "K" : 128,
      "blob_biases" : 81,
      "name" : "112",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "111",
      "weights" : {
        "W_U8" : 83,
        "per_ch_qscale" : 87,
        "per_ch_qbias" : 85
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "112",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 89,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "115",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "115"
    },
    {
      "alpha" : 1,
      "bottom" : "115,104",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "116",
      "type" : "elementwise",
      "name" : "116",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "117",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "116",
      "pad_l" : 1,
      "name" : "117",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "118",
      "K" : 128,
      "blob_biases" : 91,
      "name" : "118",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "117",
      "weights" : {
        "W_U8" : 93,
        "per_ch_qscale" : 97,
        "per_ch_qbias" : 95
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "118",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 99,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "121",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "121"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "122",
      "type" : "activation",
      "name" : "122",
      "bottom" : "121"
    },
    {
      "pad_value" : 0,
      "top" : "123",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "122",
      "pad_l" : 1,
      "name" : "123",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "124",
      "K" : 128,
      "blob_biases" : 101,
      "name" : "124",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "123",
      "weights" : {
        "W_U8" : 103,
        "per_ch_qscale" : 107,
        "per_ch_qbias" : 105
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "124",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 109,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "127",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "127"
    },
    {
      "alpha" : 1,
      "bottom" : "127,116",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "128",
      "type" : "elementwise",
      "name" : "128",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "129",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "128",
      "pad_l" : 1,
      "name" : "129",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "130",
      "K" : 128,
      "blob_biases" : 111,
      "name" : "130",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "129",
      "weights" : {
        "W_U8" : 113,
        "per_ch_qscale" : 117,
        "per_ch_qbias" : 115
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "130",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 119,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "133",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "133"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "134",
      "type" : "activation",
      "name" : "134",
      "bottom" : "133"
    },
    {
      "pad_value" : 0,
      "top" : "135",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "134",
      "pad_l" : 1,
      "name" : "135",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "136",
      "K" : 128,
      "blob_biases" : 121,
      "name" : "136",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "135",
      "weights" : {
        "W_U8" : 123,
        "per_ch_qscale" : 127,
        "per_ch_qbias" : 125
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "136",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 129,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "139",
      "C" : 128,
      "type" : "batchnorm",
      "name" : "139"
    },
    {
      "alpha" : 1,
      "bottom" : "139,128",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "140",
      "type" : "elementwise",
      "name" : "140",
      "beta" : 0
    },
    {
      "bottom" : "140",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "141",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "141"
    },
    {
      "pad_value" : 0,
      "top" : "142",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "141",
      "pad_l" : 1,
      "name" : "142",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "143",
      "K" : 128,
      "blob_biases" : 131,
      "name" : "143",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "142",
      "weights" : {
        "W_U8" : 133,
        "per_ch_qscale" : 137,
        "per_ch_qbias" : 135
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "143",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 139,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "146",
      "C" : 64,
      "type" : "batchnorm",
      "name" : "146"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "147",
      "type" : "activation",
      "name" : "147",
      "bottom" : "146"
    },
    {
      "bottom" : "147",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "148",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "148"
    },
    {
      "pad_value" : 0,
      "top" : "149",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "148",
      "pad_l" : 1,
      "name" : "149",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "150",
      "K" : 64,
      "blob_biases" : 141,
      "name" : "150",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "149",
      "weights" : {
        "W_U8" : 143,
        "per_ch_qscale" : 147,
        "per_ch_qbias" : 145
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "150",
      "training_instancenorm" : 1,
      "training_momentum" : 0.89999997615814209,
      "training" : 1,
      "blob_batchnorm_params" : 149,
      "weights" : {

      },
      "training_eps" : 9.9999997473787516e-06,
      "top" : "153",
      "C" : 32,
      "type" : "batchnorm",
      "name" : "153"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "154",
      "type" : "activation",
      "name" : "154",
      "bottom" : "153"
    },
    {
      "pad_value" : 0,
      "top" : "155",
      "pad_pad_mode" : 0,
      "pad_t" : 4,
      "pad_r" : 4,
      "pad_b" : 4,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "154",
      "pad_l" : 4,
      "name" : "155",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "outputImage",
      "K" : 32,
      "blob_biases" : 151,
      "name" : "156",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "155",
      "weights" : {
        "W_U8" : 153,
        "per_ch_qscale" : 157,
        "per_ch_qbias" : 155
      },
      "pad_mode" : 0,
      "Nx" : 9,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    }
  ]
}